package com.task.interview.utils

import com.google.gson.Gson
import com.task.interview.model.Places

const val DB_NAME = "test_database"
const val ZOOM_LEVEL = 17.0

fun testModel():Places{
    val res = " {\n" +
            "    \"places\": [\n" +
            "    {\n" +
            "        \"lat\": 35.7989818,\n" +
            "        \"lng\": 51.4036489,\n" +
            "        \"background_photo\": \"https://cdn.takhfifan.com/images/1.0?id=/155471/_/1/_11__89_7.jpg\",\n" +
            "        \"name\": \"صبحانه لاکچری در رستوران رو باز بلوط\",\n" +
            "        \"type\": \"بوفه صبحانه\",\n" +
            "        \"open\": \"19:00\",\n" +
            "        \"close\": \"23:00\",\n" +
            "        \"address\": \"ولنجک، خیابان یمن، بالاتر از مقدس اردبیلی، سمت چپ باغ گیاه شناسی\",\n" +
            "        \"photos\": [\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/155471/_/1/_18__29_3.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/155471/_/9/_9__121_6.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/155471/_/5/_5__395_27.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/155471/_/1/_18__29_3.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/155471/_/1/_15__43_5.jpg\"\n" +
            "        ],\n" +
            "        \"rate\": 4,\n" +
            "        \"options\": [\n" +
            "            \"کارت\u200Cخوان\",\n" +
            "            \"جای پارک آسان\",\n" +
            "            \"پالادیوم\",\n" +
            "            \"مالیات بر ارزش افزوده ندارد\",\n" +
            "            \"حق سرویس ندارد\"\n" +
            "        ],\n" +
            "        \"comments\": [\n" +
            "        {\n" +
            "            \"name\": \"امیر اکبری\",\n" +
            "            \"text\": \"عالی با این مبلغ\",\n" +
            "            \"date\": \"۱۳۹۹/۹/۱۳ - ۰۷:۵۴\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 5\n" +
            "        },\n" +
            "        {\n" +
            "            \"name\": \"کاربر\",\n" +
            "            \"text\": \"ضمن عرضسلام وخسته نباشيد خدمت بروبچه هاي محترم تخفيفان..بوفه صبحانه بلوط دركل نسبت به چندجاي ديگه كه رفته بودم به مراتب بهتر بود..دستشون درد نكنه..چه از لحاظ كيفيت وچه از لحاظ تنوع..فقط من نميدونم چرا بوفه صبحانه ها گردو رو باپوست ميذارن سر ميز!دليلش ميدونم گرون بودن اين خشكباره اما به نظرم زياد اينكار جالب نيست..خانم خود بنده اومد چندتا گردو بشكونه بااون گردوشكن فنرش دررفت ودست ايشون رو گاز گرفت كبود شد اصلا زهرمارمون شد ..به غير از اين ضعف واينكه ميوه يكبار بيشتر شارژنشد..الباقي درحد خوب..ممنونم..\",\n" +
            "            \"date\": \"۱۳۹۹/۹/۱۱ - ۰۸:۴۴\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 3\n" +
            "        },\n" +
            "        {\n" +
            "            \"name\": \"fatemeh jalili\",\n" +
            "            \"text\": \"همه چی عالی بود اگه یه بخشی رو هم داشتن که نون تازه میپخت و املت بهترم میشد البته موسیقی ندارن و موسیقی هم خیلی مهمه ممنون\",\n" +
            "            \"date\": \"۱۳۹۹/۸/۳۰ - ۰۹:۴۱\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 4\n" +
            "        }\n" +
            "        ]\n" +
            "    },{\n" +
            "        \"lat\": 35.7687446,\n" +
            "        \"lng\": 51.3703111,\n" +
            "        \"background_photo\": \"https://cdn.takhfifan.com/images/1.0?id=/187861/6/_/6_397_15.jpg\",\n" +
            "        \"name\": \"برگر جان\",\n" +
            "        \"type\": \"فست فود\",\n" +
            "        \"open\": \"11:30\",\n" +
            "        \"close\": \"23:30\",\n" +
            "        \"address\": \"شهرک غرب، بلوار دریا، خیابان گلها، نبش خیابان توحید سوم\",\n" +
            "        \"photos\": [\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/187861/8/_/8_218_12.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/187861/1/_/1_1045_14.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/187861/4/_/4_721_27.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/187861/7/_/7_280_13.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/187861/0/0/009_6_1.jpg\"\n" +
            "        ],\n" +
            "        \"rate\": 4.1,\n" +
            "        \"options\": [\n" +
            "            \"کارت\u200Cخوان\",\n" +
            "            \"جای پارک آسان\",\n" +
            "            \"حق سرویس ندارد\"\n" +
            "        ],\n" +
            "        \"comments\": [\n" +
            "        {\n" +
            "            \"name\": \"maryam naderi\",\n" +
            "            \"text\": \"پيتزا مخلوطش خوشمزه بود\",\n" +
            "            \"date\": \"۱۳۹۹/۳/۲۱ - ۲۰:۵۵\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 5\n" +
            "        }\n" +
            "        ]\n" +
            "\n" +
            "    },{\n" +
            "        \"lat\": 35.6872666,\n" +
            "        \"lng\": 51.4803987,\n" +
            "        \"background_photo\": \"https://cdn.takhfifan.com/images/1.0?id=/182877/r/e/restooran-naghsh-jahan_1_.jpg\",\n" +
            "        \"name\": \"رستوران مجلل نقش جهان\",\n" +
            "        \"type\": \"ایرانی\",\n" +
            "        \"open\": \"11:00\",\n" +
            "        \"close\": \"23:00\",\n" +
            "        \"address\": \"پیروزی، خیابان پرستار شمالی، بعد از چهارراه نساجی، پلاک 410\",\n" +
            "        \"photos\": [\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/182877/r/e/restooran-naghsh-jahan_9_.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/182877/r/e/restooran-naghsh-jahan_8_.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/182877/r/e/restooran-naghsh-jahan_5_.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/182877/r/e/restooran-naghsh-jahan_2_.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/182877/r/e/restooran-naghsh-jahan_10_.jpg\"\n" +
            "        ],\n" +
            "        \"rate\": 4.6,\n" +
            "        \"options\": [\n" +
            "            \"ظرفیت ۱۲۰ نفر\",\n" +
            "            \"پیشنهاد سرآشپز کباب اسکله مخصوص نقش جهان\",\n" +
            "            \"جای پارک آسان دارد\",\n" +
            "            \"غذایی سنتی و فوق العاده\"\n" +
            "        ],\n" +
            "        \"comments\": [\n" +
            "        {\n" +
            "            \"name\": \"حامد حاج عبدالباقی\",\n" +
            "            \"text\": \"ما رفتیم رفتار پرسنل خوب بود.ولی نکته ای که باید گفت که ماهی پر از تیغ بود که تیغ رو جدا نکرده بودند و کاملا کباب نشده بود و کاملا به سختی قابل خوردن بود ولی همه چی عالی بود.\",\n" +
            "            \"date\": \"۱۳۹۹/۶/۳ - ۲۱:۱۳\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 4\n" +
            "        },{\n" +
            "            \"name\": \"Benyamin Karani\",\n" +
            "            \"text\": \"حتما پیشنهاد میکنم برید... جای مَشتی ای بود ????\",\n" +
            "            \"date\": \"۱۳۹۹/۵/۱۵ - ۲۲:۳۷\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 5\n" +
            "        },{\n" +
            "            \"name\": \"مهدی عمادی\",\n" +
            "            \"text\": \"رستوران خوبی است و کیفیت مورد قبولی دارد\",\n" +
            "            \"date\": \"۱۳۹۹/۳/۲۳ - ۱۴:۵۰\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 5\n" +
            "        }\n" +
            "        ]\n" +
            "\n" +
            "    },{\n" +
            "        \"lat\": 35.7754432,\n" +
            "        \"lng\": 51.3620852,\n" +
            "        \"background_photo\": \"https://cdn.takhfifan.com/images/1.0?id=/180794/2/0/20_34_5.jpg\",\n" +
            "        \"name\": \"تهران بين\",\n" +
            "        \"type\": \"کافه و رستوران\",\n" +
            "        \"open\": \"09:00\",\n" +
            "        \"close\": \"23:00\",\n" +
            "        \"address\": \"سعادت آباد، خیابان سرو غربی، خیابان ریاضی بخشایش، کوچه هفدهم، برج عرفان، طبقه نهم\",\n" +
            "        \"photos\": [\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/180794/1/8/18_48_6.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/180794/3/_/3_733_52.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/180794/1/7/17_49_10.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/180794/1/1/11_111_15.jpg\",\n" +
            "            \"https://cdn.takhfifan.com/images/1.0?id=/180794/7/_/7_267_26.jpg\"\n" +
            "        ],\n" +
            "        \"rate\": 4,\n" +
            "        \"options\": [\n" +
            "            \"ظرفیت ۲۲۰ نفر\",\n" +
            "            \"کارت\u200Cخوان : دارد\",\n" +
            "            \"جای پارک آسان دارد\"\n" +
            "        ],\n" +
            "        \"comments\": [\n" +
            "        {\n" +
            "            \"name\": \"مرتضی دشتی زاده\",\n" +
            "            \"text\": \"بیش از ظرفیت واقعی رستوران، اقدام به پذیرش مهمان می کنند که مشکلاتی برای مراجعه کنندگان ایجاد می کند. علیرغم تماس قبلی و اعلام تعداد نفرات، میز مناسب در محل رستوران وجود نداشت. در منوی صبحانه به غیر از نسکافه 3 در 1، هیچگونه قهوه دمی ولو با کیفیت پایین وجود ندارد. پرسنل مجموعه نیز در ارتباط با مشتری بسیار آماتور رفتار می کنند\",\n" +
            "            \"date\": \"۱۳۹۸/۱۱/۲۵ - ۰۹:۰۷\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 4\n" +
            "        },{\n" +
            "            \"name\": \"علی شالپوش\",\n" +
            "            \"text\": \"منو بسیار ضعیف نسبت به رستوران های دیگر جهت سرو صبحانه\",\n" +
            "            \"date\": \"۱۳۹۸/۱۱/۲۵ - ۰۸:۴۴\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 3\n" +
            "        },{\n" +
            "            \"name\": \"azadeh zamani\",\n" +
            "            \"text\": \"یک صبحانه خوب و خوشمزه در کنار نوای دلنشین پیانو\",\n" +
            "            \"date\": \"۱۳۹۸/۱۱/۱۸ - ۰۸:۴۶\",\n" +
            "            \"photo\": \"\",\n" +
            "            \"rate\": 5\n" +
            "        }\n" +
            "        ]\n" +
            "\n" +
            "    }\n" +
            "    ]\n" +
            "} "

    return Gson().fromJson(res, Places::class.java)
}

